<?
$lang['error_upload_file'] = 'Файл не был загружен';
$lang['invalid_file_format'] = 'Файл должен содержать только одну функцию' . "\nИмя функции должно совпадать с именем файла без расширения.
Например, файл task1.js, функция task1.
";
$lang['file_too_big'] = 'Это потрясающе, но файл слишком велик';
$lang['success_append_file'] = 'Файл успешно загружен';
$lang['success_update_file'] = 'Файл успешно обновлен';
$lang['unauth_and_cookie_trouble'] = 'Вероятно, у вас отключены куки в браузере.
Если вы будете видеть эту ошибку снова и снова, включите их';
$lang['warning_anonim_user'] = 'Ваш загруженный файл будет доступен из этого браузера пока длится текущая веб-сессия.
Для более длительного хранения зарегистрируйтесь.';
$lang['update'] = 'Обновить';
$lang['remove'] = 'Удалить';
$lang['fail_delete_user_script_try_update'] = 'Не удалось удалить скрипт, попробуйте обновить страницу и повторить попытку';
$lang['information'] = 'Информация';
$lang['file_upload'] = 'Загрузка файла';
$lang['function_named'] = 'Функция с именем';
$lang['not_found'] = 'не найдена';
$lang['try_upload_yuor_file_again'] = 'Попробуйте перезалить ваш файл повторно';
$lang['fail_remove_script_msg'] = 'Не удалось удалить скрипт, попробуйте обновить страницу и повторить попытку';
$lang['confirm_removal_script'] = 'Вы уверены, что хотите удалить скрипт?';
$lang['need_select_file'] = 'Необходимо выбрать файл';
$lang['want_clone_file'] = 'Среди ваших файлов уже есть файл с таким именем. Вы уверены, то хотите продолжить?';
$lang['QuickStart'] = 'Быстрый старт';
$lang['Help'] = 'Помощь';
$lang['TaskList'] = 'Список задач';
$lang['Exit'] = 'Выход';
$lang['SignUp'] = 'Регистрация';
$lang['your_programs'] = 'Ваши программы';
$lang['text_editor'] = 'Редактор кода';
$lang['get_actual_browser'] = 'Вы используете несовременный браузер. Скачайте последнюю версию гугл хром или обновитесь до последней версии Интернет эксплорер.\nПоследние версии Opera b Firefox тоже прекрасно подойдут )';
$lang['fail_save_file_try_again'] = 'Ошибка сохранения файла. Попробуйте снова.';
$lang['unable_get_function_name_check_code'] = 'Не удалось определить имя главной функции, проверьте свой код.';
$lang['Save'] = 'Сохранить';
$lang['SaveAs'] = 'Сохранить';
$lang['Run'] = 'Выполнить';
$lang['fail_save_user_script_try_update'] = 'Не удалось сохранить скрипт, попробуйте обновить страницу и повторить попытку';
$lang['programm_with_name_exists'] = 'Программа с таким именем уже существует. Переименуйте главную функцию.';
$lang['main_function_require'] = 'Вам необходимо добавить главную функцию в редакторе кода.';
$lang['Console'] = 'Консоль';
$lang['Output'] = 'Вывод приложения';
$lang['Line'] = 'Строка';
$lang['Column'] = 'Символ';
$lang['fail_save_file_enter_it_name'] = 'Файл не найден, введите его имя';
$lang['Openfile'] = 'Открыть файл';
$lang['file-remove'] = 'Удалить файл';
$lang['file-rename'] = 'Переименовать файл';
$lang['unable_load_file_list_try_later'] = 'Не удалось загрузить список пользоовательских файлов попробуйте обновить страницу.';
$lang['no_your_file'] = 'У вас пока нет файлов';
$lang['file_name_require'] = 'Необходимо ввести имя файла';
$lang['alien_file_or_other_ipdate_page'] = 'Не удалось переименовать файл. Возможно он чужой или вы работаете без регистрации и у вас закончилась веб-сессия, если это не так, просто перезагрузите страницу.';
$lang['remove_alien_file_or_other_update_page'] = 'Не удалось удалить файл. Возможно он чужой или вы работаете без регистрации и у вас закончилась веб-сессия, если это не так, просто перезагрузите страницу.';
$lang['load_file_fail'] = 'Не удалось загрузить файл. Возможно он чужой или вы работаете без регистрации и у вас закончилась веб-сессия, если это не так, просто перезагрузите страницу.';


//quick_start
$lang['intro'] = 'Что это';
$lang['wtf'] = 'Как этим пользоваться';
