<h3>Вариант 1</h3>
<div>
<h4>Задание 1</h4>
<ol>
	<li>
	<p> Вычислить</p>
		<img src="<?=WEB_ROOT?>/files/tasks/1/1.1.png" />
	</li><li>
	<p> Вычислить</p>
		<?=TasklistHandler::tim(1, 1, 2)?>
	</li><li>
	<p>Заданы координаты трех вершин треугольника (x<sub>1</sub>,y<sub>1</sub>), (x<sub>2</sub>,y<sub>2</sub>), (x<sub>3</sub> ,y<sub>3</sub>). Найти его периметр и площадь</p>
	</li>
</ol>
</div>
<div>
<h4>Задание 2</h4>
<ol>
	<li>
	<p> Вычислить</p>
		<?=TasklistHandler::tim(1, 2, 1)?>
	</li><li>
	<p>Даны три действительные числа. Возвести в квадрат те из них, значения которых неотрицательны, и в четвертую степень – отрицательные.</p>
	</li><li>
	<p>Найти max {min (a, b), min (c, d)}.</p>
	</li>
</ol>
</div>
<div>
<h4>Задание 3</h4>
<ol>
	<li>
	<p>Имеется серия измерений элементов треугольника. Группы элементов пронумерованы.<br>
	В серии в произвольном порядке могут встречаться такие группы элементов треугольника:<br>
	<div class="enum">1)	основание и высота;</div>
	<div class="enum">2)	две стороны и угол между ними (угол задан в радианах);</div>
	<div class="enum">3)	три стороны.</div>
	Составить программу, которая запрашивает номер группы элементов, вводит соответствующие элементы и вычисляет площадь треугольника.
	Вычисления прекратить, если в качестве номера группы введен 0.</p>
	</li><li>
	<p>Дано натуральное число N. Вычислить:</p>
		<?=TasklistHandler::tim(1, 3, 2)?>
	</li><li>
	<p>Найти сумму ряда с точностью &epsilon;=0,001 , общий член которого:</p>
		<?=TasklistHandler::tim(1, 3, 3)?>
	</li>
</ol>
</div>
<div>
<h4>Задание 4</h4>
<ol>
	<li>
	<p>Подсчитать, сколько раз в данной строке встречается буква Ch, вводимая с клавиатуры. </p>
	</li><li>
	<p>Дана символьная строка, заканчивающаяся точкой. Подсчитать, сколько слов в строке.</p>
	</li><li>
	<p>Символьная строка содержит одно слово. Проверить, будет ли оно читаться одинаково справа налево и слева направо (т.е. является ли оно палиндромом).</p>
	</li>
</ol>
</div>
<div>
<h4><?=$lang['Task']?> 5</h4>
<ol>
	<li>
	<p>Найти сумму всех чётных элементов массива, стоящих на чётных местах, то есть имеющие чётные номера.</p>
	</li><li>
	<p>В прямоугольной матрице, размерностью n*m, заполненной случайным образом числами из промежутка [-40,30], найти сумму и количество элементов каждого столбца с заданным условием (хранить эти значения в массивах):  элементы, кратные k1 или k2.</p>
	</li><li>
	<p>Вставить первую строку после строки, в которой находится первый встреченный максимальный элемент.</p>
	</li>
</ol>
</div>
<div>
<h4><?=$lang['Task']?> 6</h4>
<ol>
	<li>
	<p>Треугольник задан координатами своих вершин. Составить программу вычисления его площади</p>
	</li><li>
	<p>Дано натуральное число N. Составить программу формирования массива, элементами которого являются цифры числа N.</p>
	</li><li>
	<p>Решите задачу, используя рекурсивную подпрограмму.Найдите сумму цифр заданного натурального числа.</p>
	</li>
</ol>
</div>
<div>
<h4><?=$lang['Task']?> 7</h4>
<ol>
	<li>
	<p>В озере водится несколько видов рыб. Три рыбака поймали рыб, представляющих некоторые из имеющихся видов. 
	Определить какие виды рыб есть у каждого рыбака; какие виды рыб выловил хотя бы один рыбак; какие рыбы есть в озере, но их не выловил ни один из рыбаков</p>
	</li><li>
	<p>Дан текст из цифр и строчных латинских букв, за которыми следует точка. Определить, каких букв – гласных или согласных – больше в этом тексте; напечатать в алфавитном порядке все согласные буквы, которые входят только в одно слово.</p>
	</li><li>
	<p>В равенстве сук*сук=барсук замените буквы цифрами так, чтобы получилось тождество.</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 8 (<?=$lang['Objects']?>)</h4>
<ol>
	<li>
	<p>Использовать объекты для хранения информации об учениках. Вывести на экран список учеников, фамилии которых начинаются на букву В с указанием даты их рождения. (Предварительно создать какой-то список учеников с фамилиями начинающимися на различные буквы.)</p>
	</li><li>
	<p>Написать программу, определяющую дату следующего (предыдущего) дня.</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 9</h4>
<ol>
	<li>
	<p>Создать окно в рамке  на фоне, заполненном псевдографическим символом #178 зеленого цвета, с текстом из файла. По клавишам управления курсором выполнять скроллинг текста в окне на одну строку вверх или вниз.</p>
	</li>
</ol>
</div>
<div>
<h4><?=$lang['Task']?> 10</h4>
<ol>
	<li>
	<p>Задать граф матрицей смежности и обеспечить графический пошаговый вывод его вершин.</p>
	</li>
</ol>
</div>
