<h3>Вариант 8</h3>
<div>
<h4>Задание 1</h4>
<ol>
	<li>
	<p>Вычислить</p>
		<img src="<?=WEB_ROOT?>/files/tasks/10/1.1.png" />
	</li><li>
	<p>Вычислить</p>
		<?=TasklistHandler::tim(10, 1, 2)?>
	</li><li>
	<p>Три сопротивления соединены параллельно. Найдите сопротивление соединения.</p>
	</li>
</ol>
</div>

<div>
<h4>Задание 2</h4>
<ol>
	<li>
	<p>Вычислить</p>
		<?=TasklistHandler::tim(10, 2, 1)?>
	</li><li>
	<p>Определить, является ли целое число N четным двузначным числом.</p>
	</li><li>
	<p>Дано число х. Напечатать в порядке возрастания числа sin x, cos x, ln x. Если при каком-либо х некоторые из выражений не имеют смысла, вывести сообщение об этом и сравнивать значения только тех, которые имеют смысл.</p>
	</li>
</ol>
</div>

<div>
<h4>Задание 3</h4>
<ol>
	<li>
	<p>Составить программу-генератор простых чисел, в основу положить формулу 2х<sup>2</sup> + 29 при 0 &lt; х &lt;= 28.</p>
	</li><li>
	<p>Дано действительное x. Вычислить:</p>
		<?=TasklistHandler::tim(10, 3, 2)?>
	</li><li>
	<p>Найти сумму ряда с точностью &epsilon;=0,001 , общий член которого:</p>
		<?=TasklistHandler::tim(10, 3, 3)?>
	</li>
</ol>
</div>
<div>
<h4>Задание 4</h4>
<ol>
	<li>
	<p>Дана последовательность слов. Напечатать все слова, отличные от слова «hello”. </p>
	</li><li>
	<p>Дана символьная строка. Подсчитать количество букв k в последнем ее слове.</p>
	</li><li>
	<p>Результаты вступительных экзаменов представлены в виде списка из N строк, в каждой строке которого записаны фамилия студента и отметки по каждому из М экзаменов. Определить количество абитуриентов, сдавших вступительные экзамены на «отлично».</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 5</h4>
<ol>
	<li>
	<p>Сколько элементов массива превосходят по модулю заданное число А.</p>
	</li><li>
	<p>Определить, есть ли в данном массиве два одинаковых элемента.</p>
	</li><li>
	<p>Поменять местами первый максимальный и последний минимальный элементы.</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 6</h4>
<ol>
	<li>
	<p>Написать программу вычисления суммы факториалов всех нечетных чисел от 1 до 9.</p>
	</li><li>
	<p>Натуральное число, в записи которого n цифр, называется числом Амстронга, если сумма его цифр, возведенная в степень n, равна самому числу. Найти все числа Амстронга от 1 до k. </p>
	</li><li>
	<p>Дана символьная строка, представляющая собой запись натурального числа в р-ичной системе счисления (2 &lt;= р &lt;= 9). Составить программу перевода этого числа в десятичную систему счисления. </p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 7</h4>
<ol>
	<li>
	<p>Три дачника выращивают на своих участках цветы из имеющегося списка (ирис, роза, астра, пион, георгин, хризантема, гладиолус). Определить какие виды цветов выращивают все дачники; хотя бы два дачника; не выращивает ни один из дачников.</p>
	</li><li>
	<p>Дан текст на русском языке. Напечатать в алфавитном порядке все согласные буквы, которые входят только в одно слово; все звонкие согласные, которые не входят ни в одно слово.</p>
	</li><li>
	<p>В равенстве ВЕК + ЖИВИ + ВЕК = УЧИСЬ замените буквы цифрами так, чтобы получилось тождество.</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 8 (<?=$lang['Objects']?>)</h4>
<ol>
	<li>
	<p>Распечатать список тех учителей школы, которые преподают математику и информатику, указать стаж их работы и недельную нагрузку.</p>
	</li><li>
	<p>
		Сгенерировать 30 объектов вида 
		<pre class="no_copy"><b>var</b> obj {key:1, text:<span class="strcolor">'любой_текст'</span>}</pre>
		Считая, что каждый объект имеет уникальный ключ, описать процедуру, упорядочивающую записи таблицы по убыванию значений поля Key.
	</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 9</h4>
<ol>
	<li>
	<p>Создать окно в рамке  на фоне, заполненном псевдографическим символом #176 синего цвета, с текстом из файла. Выполнять перемещение окна вверх, вниз, вправо или влево с сохранением фона по клавишам управления курсором.</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 10</h4>
<ol>
	<li>
	<p>Сгенерировать граф, реализовать поиск остова графа с использованием алгоритма поиска в глубину и обеспечить графическую визуализацию.</p>
	</li>
</ol>
</div>
