<h3><?=$lang['Variant']?> 2</h3>
<div>
<h4><?=$lang['Task']?> 1</h4>
<ol>
	<li>
	<p> Вычислить</p>
		<?=TasklistHandler::tim(2, 1, 1)?>
	<li>
	<p> Вычислить</p>
		<?=TasklistHandler::tim(2, 1, 2)?>
	<li>
	<p>Дана сторона равностороннего треугольника. Найти площадь этого треугольника, его высоты, радиусы вписанной и описанной окружностей.</p>
</ol>
</div>
<div>
<h4><?=$lang['Task']?> 2</h4>
<ol>
	<li>
		<p> Вычислить</p>
			<?=TasklistHandler::tim(2, 2, 1)?>
		<li>
		<p>Даны две точки А(<sub>1</sub> , y<sub>1</sub>),  В(x<sub>2</sub>, y<sub>2</sub>). Составить алгоритм, определяющий, которая из точек находится ближе к началу координат.</p>
	<li>
	<p>Даны три числа  m, n, p. Определить какое из них равно d. Если ни одно не рано d, то найти max(d-m, d-n, d-p).</p>
</ol>
</div>
<div>
<h4><?=$lang['Task']?> 3</h4>
<ol>
	<li>
	<p>Начав тренировки, спортсмен в первый день пробежал 10 км. Каждый день он увеличивал дневную норму на 10% нормы предыдущего дня. Какой уммарный путь пробежит спортсмен за 7 дней?</p>
	<li>
	<p>Дано натуральное число N. Вычислить:</p>
		<?=TasklistHandler::tim(3, 3, 2)?>
	<li>
	<p>Найти сумму ряда с точностью &epsilon;=0,001 , общий член которого:</p>
		<?=TasklistHandler::tim(3, 3, 3)?>
</ol>
</div>
<div>
<h4><?=$lang['Task']?> 4</h4>
<ol>
	<li>
	<p>Дан текст, в котором записано одно из стихотворений А.С. Пушкина. Сколько раз в каждой строке встречается данный символ? </p>
	<li>
	<p>Дана символьная строка, содержащая английский текст. Найти количество слов, начинающихся с буквы b.</p>
	<li>
	<p>В записке слова зашифрованы – каждое из них записано наоборот. Расшифровать сообщение.</p>
</ol>
</div>
<div>
<h4><?=$lang['Task']?> 5</h4>
<ol>
	<li>
	<p>Найти сумму и произведение первых пяти элементов массива.</p>
	<li>
	<p>В прямоугольной матрице, размерностью n*m, заполненной случайным образом числами из промежутка [-40,30], найти сумму и количество элементов каждого столбца с заданным условием (хранить эти значения в массивах): элементы, попадающие в промежуток от А до В.</p>
	<li>
	<p>Вставить второй столбец после первого столбца, в котором все элементы положительны. Если такого столбца нет, то сообщить об этом.</p>
</ol>
</div>
