<h3>Вариант 3</h3>
<div>
<h4>Задание 1</h4>
<ol>
	<li>
	<p> Вычислить</p>
		<img src="<?=WEB_ROOT?>/files/tasks/3/1.1.png" />
	</li><li>
	<p> Вычислить</p>
		<?=TasklistHandler::tim(3, 1, 2)?>
	</li><li>
	<p>Найти сумму членов арифметической прогрессии, если известны ее первый член, знаменатель и число членов прогрессии.</p>
	</li>
</ol>
</div>

<div>
<h4>Задание 2</h4>
<ol>
	<li>
	<p> Вычислить</p>
		<?=TasklistHandler::tim(3, 2, 1)?>
	</li><li>
	<p>Даны два угла треугольника (в градусах ). Определить существует ли такой треугольник. Если да, то будет ли он прямоугольным</p>
	</li><li>
	<p>Даны четыре точки А1(x1, y1), А2(x2, y2), А3(x3, y3), А4(x4, y4). Определить будут ли они вершинами параллелограмма.</p>
	</li>
</ol>
</div>

<div>
<h4>Задание 3</h4>
<ol>
	<li>
	<p>Одноклеточная амеба каждые 3 часа делится на 2 клетки. Определить, сколько амеб будет через 3, 6, 9, 12, ... , 24 часа ?</p>
	</li><li>
	<p>Дано натуральное число N. Вычислить произведение первых N сомножителей:</p>
		<?=TasklistHandler::tim(3, 3, 2)?>
	</li><li>
	<p>Найти сумму ряда с точностью &epsilon;=0,001 , общий член которого:</p>
		<?=TasklistHandler::tim(3, 3, 3)?>
	</li>
</ol>
</div>

<div>
<h4>Задание 4</h4>
<ol>
	<li>
	<p>Дан текст, в котором записано одно из стихотворений А.С. Пушкина. Сколько раз встречаются гласные буквы? </p>
	</li><li>
	<p>Дана символьная строка. Подсчитать в ней количество вхождений букв r, k, t.</p>
	</li><li>
	<p>Проверить, одинаковое ли число открывающихся и закрывающихся скобок в данной строке.</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 5</h4>
<ol>
	<li>
	<p>Найти сумму элементов с k1-го по k2-ой, где k1 и k2 вводятся с клавиатуры. Сделайте проверку корректности их ввода.</p>
	</li><li>
	<p>В прямоугольной матрице, размерностью n*m, заполненной случайным образом числами из промежутка [-40,30], найти сумму и количество элементов каждого столбца с заданным условием (хранить эти значения в массивах): данные элементы положительные и лежат выше главной диагонали.</p>
	</li><li>
	<p>Вставить нулевую строку и нулевой столбец перед строкой и столбцом, где находится первый минимальный элемент.</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 6</h4>
<ol>
	<li>
	<p>Составить программу нахождения наибольшего общего делителя четырех натуральных чисел. </p>
	</li><li>
	<p>Заменить данное натуральное число на число, которое получается из исходного записью его цифр в обратном порядке. Например, дано число 156, нужно получить 651.</p>
	</li><li>
	<p>Описать функцию С(m,n), где 0 &lt;= m &lt;= n, для вычисления биномиального коэффициента C<sup>m</sup>n<sub></sub> по следующей формуле:</p>
	<?=TasklistHandler::tim(3, 6, 3); ?>
	</li>
</ol>
</div>
<div>
<h4><?=$lang['Task']?> 7</h4>
<ol>
	<li>
	<p>В трех магазинах продают некоторые виды товаров из имеющегося списка. Определить какие товары продаются в каждом магазине; какие товары продают только в одном магазине; какие товары есть хотя бы в двух магазинах.</p>
	</li><li>
	<p>Дан текст на русском языке. Напечатать в алфавитном порядке все гласные буквы, которые входят в каждое слово; все согласные, которые не входят хотя бы в одно слово.</p>
	</li><li>
	<p>В равенстве ЛУЧ + ЛУЧ = УГОЛ замените буквы цифрами так, чтобы получилось тождество.</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 8 (<?=$lang['Objects']?>)</h4>
<ol>
	<li>
	<p>Вычислить средний балл учеников класса, если известны оценки каждого ученика по математике, русскому языку и физике. Распечатать список учеников, имеющих средний балл выше среднего в классе.</p>
	</li><li>
	<p>Написать программу, определяющую дату, которая была за m дней до сегодняшнего дня</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 9</h4>
<ol>
	<li>
	<p>Создать окно в рамке  с тенью на фоне, заполненном псевдографическим символом #176 желтого цвета, с текстом из файла. Выполнять перемещение окна вверх, вниз, вправо или влево с сохранением фона по клавишам управления курсором.</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 10</h4>
<ol>
	<li>
	<p>Сгенерировать неориентированный граф и обеспечить графический пошаговый вывод его вершин.</p>
	</li>
</ol>
</div>
