<h3>Вариант 5</h3>
<div>
<h4>Задание 1</h4>
<ol>
	<li>
	<p>Вычислить</p>
		<img src="<?=WEB_ROOT?>/files/tasks/5/1.1.png" />
	</li><li>
	<p>Вычислить</p>
		<?=TasklistHandler::tim(5, 1, 2)?>
	</li><li>
	<p>Даны два числа. Найти среднее арифметическое кубов этих чисел и среднее геометрическое модулей этих чисел.</p>
	</li>
</ol>
</div>

<div>
<h4>Задание 2</h4>
<ol>
	<li>
	<p></p>
		<?=TasklistHandler::tim(5, 2, 1)?>
	</li><li>
	<p>На плоскости XOY задана своими координатами точка А. Указать, где она расположена: на какой оси или в каком координатном угле</p>
	</li><li>
	<p>Даны действительные числа a, b, c. Удвоить эти числа, если a>=b>=c и заменить их абсолютными значениями, если это не так</p>
	</li>
</ol>
</div>

<div>
<h4>Задание 3</h4>
<ol>
	<li>
	<p>У гусей и кроликов вместе 64 лапы. Сколько могло быть кроликов и гусей (указать все сочетания, которые возможны)?</p>
	</li><li>
	<p>Дано натуральное число N. Вычислить:</p>
		<?=TasklistHandler::tim(5, 3, 2)?>
	</li><li>
	<p>Найти сумму ряда с точностью &epsilon;=0,001 , общий член которого:</p>
		<?=TasklistHandler::tim(5, 3, 3)?>
	</li>
</ol>
</div>
<div>
<h4>Задание 4</h4>
<ol>
	<li>
	<p>Заменить в заданной строке все буквы Char1 на Char2 (их значения вводить с клавиатуры)</p>
	</li><li>
	<p>Дана символьная строка, cодержащая текст, который заканчивается точкой. Найти длину самого короткого слова и самого длинного слова</p>
	</li><li>
	<p>Упорядочить данный массив английских слов по алфавиту, рассматривая только первый символ каждого слова</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 5</h4>
<ol>
	<li>
	<p>5. Найти сумму элементов массива, принадлежащих промежутку от А до В (А и В вводятся с клавиатуры).</p>
	</li><li>
	<p>Найти сумму элементов в строках с k1-й по k2-ю</p>
	</li><li>
	<p>Вставить перед столбцом, в котором нет отрицательных элементов, второй столбец</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 6</h4>
<ol>
	<li>
	<p>Написать программу нахождения суммы большего и меньшего из 3 чисел. </p>
	</li><li>
	<p>Даны три квадратных матрицы A, B, С n-го порядка. Вывести на печать ту из них, норма которой наименьшая. Пояснение. Нормой матрицы считать максимум из абсолютных величин ее элементов.</p>
	</li><li>
	<p>Описать функцию min(x) для определения минимального элемента линей­ного массива х, введя вспомогательную рекурсивную функцию min1(k), находя­щую минимум среди последних элементов массива х, начиная с k-го</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 7</h4>
<ol>
	<li>
	<p>Задан некоторый набор товаров. Определить для каждого из товаров, какие из них имеются в каждом из N магазинов; какие товары есть хотя бы в одном магазине; каких товаров нет ни в одном из магазинов.</p>
	</li><li>
	<p>Дан текст из строчных латинских букв, за которыми следует точка. Напечатать все буквы, входящие в текст по одному разу; все согласные, которые входят в каждое слово</p>
	</li><li>
	<p>В равенстве ЛОБ + ТРИ = САМ замените буквы цифрами так, чтобы получилось тождество.</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 8 (<?=$lang['Objects']?>)</h4>
<ol>
	<li>
	<p>Из ассортимента конфет, выпускаемых пермской кондитерской фабрикой, выбрать те, стоимость которых от 10 до 15 тыс. рублей за 1 кг. Указать срок их годности и номера магазинов, в которых они имеются в продаже</p>
	</li><li>
	<p>Написать программу, определяющую день недели, выпадающий на дату t1, если известно, что в первый день нашей эры был понедельник</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 9</h4>
<ol>
	<li>
	<p>Создать окно в рамке  на фоне, заполненном псевдографическим символом #178 зеленого цвета, с текстом из файла. По клавишам управления курсором выполнять скроллинг текста в окне на одну строку вверх или вниз</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 10</h4>
<ol>
	<li>
	<p>Сгенерировать граф, реализовать поиск связных компонент и обеспечить графическую визуализацию.</p>
	</li>
</ol>
</div>
