<h3>Вариант 1</h3>
<div>
<h4>Задание 1</h4>
<ol>
	<li>
	<p> Вычислить</p>
		<img src="<?=WEB_ROOT?>/files/tasks/6/1.1.png" />
	</li><li>
	<p> Вычислить</p>
		<?=TasklistHandler::tim(6, 1, 2)?>
	</li><li>
	<p>Известна длина окружности. Найти площадь круга, ограниченного этой окружностью.</p>
	</li>
</ol>
</div>
<div>
<h4>Задание 2</h4>
<ol>
	<li>
	<p> Вычислить</p>
		<?=TasklistHandler::tim(1, 2, 1)?>
	</li><li>
	<p>Даны целые числа m и n. Если числа не равны, то заменить каждое из них одним и тем же числом, равным большему из исходных, а если равны, то заменить числа нулями.</p>
	</li><li>
	<p>На оси ОХ расположены три точки a, b, c. Определить какая из точек b, c расположена ближе к а.</p>
	</li>
</ol>
</div>

<div>
<h4>Задание 3</h4>
<ol>
	<li>
	<p>Составить алгоритм решения задачи: сколько можно купить быков, коров и телят, платя за быка 10 р., за корову - 5 р., 
	а за теленка - 0,5 р., если на 100 р. надо купить 100 голов скота?</p>
	</li><li>
	<p>Даны: натуральное n, действительное х. Вычислить:</p>
		<?=TasklistHandler::tim(6, 3, 2)?>
	</li><li>
	<p>Найти сумму ряда с точностью &epsilon;=0,001 , общий член которого:</p>
		<?=TasklistHandler::tim(6, 3, 3)?>
	</li>
</ol>
</div>
<div>
<h4>Задание 4</h4>
<ol>
	<li>
	<p>Заменить все вхождения подстроки Str1 на подстроку Str2, которые вводятся с клавиатуры.</p>
	</li><li>
	<p>Дана строка символов, среди которых есть двоеточие (:). Определить, сколько символов ему предшествует</p>
	</li><li>
	<p>Выписать из символьной строки слова, начинающиеся и заканчивающиеся на одну и ту же букву</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 5</h4>
<ol>
	<li>
	<p>Найти номера всех отрицательных элементов массива (вывести их на экран), если таких нет, то сообщить об этом</p>
	</li><li>
	<p>Найти номера всех максимальных элементов</p>
	</li><li>
	<p>Удалить столбец, в котором находится минимальный элемент</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 6</h4>
<ol>
	<li>
	<p>Вычислить площадь правильного шестиугольника со стороной a, используя подпрограмму вычисления площади треугольника.</p>
	</li><li>
	<p>Два натуральных числа называются «дружественными», если каждое из них равно сумме всех делителей (кроме его самого) другого (например, числа 220 и 284). Найти все пары «дружественных чисел», которые не больше данного числа N. </p>
	</li><li>
	<p>Решите задачу, используя рекурсивную подпрограмму. Описать рекурсивную логическую функцию Simm(S, i, j), проверяющую, является ли симметричной часть строки S, начинающаяся i-м и кончающаяся j-м ее элементами.</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 7</h4>
<ol>
	<li>
	<p>Известны марки машин, изготовляемых в данной стране и импортируемых за рубеж. Даны некоторые N стран. Определить для каждой из марок, какие из них были доставлены во все страны; доставлены в некоторые из стран; не доставлены ни в одну страну.</p>
	</li><li>
	<p>Дан текст на русском языке. Напечатать в алфавитном порядке все согласные буквы, которые не входят ни в одно слово; все гласные буквы, которые входят в текст более двух раз</p>
	</li><li>
	<p>В равенстве ГОЛ * ГОЛ = ФУТБОЛ замените буквы цифрами так, чтобы получилось тождество.</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 8 (<?=$lang['Objects']?>)</h4>
<ol>
	<li>
	<p>Распечатать список учеников музыкальной школы, которые учатся играть на скрипке. Указать также, сколько лет они занимаются музыкой и принимали ли участие в каких-либо конкурсах.</p>
	</li><li>
	<p>Дан массив, содержащий информацию об учениках некоторой школы. Заполнить второй массив данными об учениках только девятых классов.</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 9</h4>
<ol>
	<li>
	<p>Создать окно в рамке  на фоне, заполненном псевдографическим символом #176 синего цвета, с текстом из файла. Выполнять перемещение окна вверх, вниз, вправо или влево с сохранением фона по клавишам управления курсором.</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 10</h4>
<ol>
	<li>
	<p>Сгенерировать граф, реализовать поиск сильных компонент и обеспечить графическую визуализацию.</p>
	</li>
</ol>
</div>
