<h3>Вариант 8</h3>
<div>
<h4>Задание 1</h4>
<ol>
	<li>
	<p> Вычислить</p>
		<img src="<?=WEB_ROOT?>/files/tasks/9/1.1.png" />
	</li><li>
	<p> Вычислить</p>
		<?=TasklistHandler::tim(9, 1, 2)?>
	</li><li>
	<p>Дана длина ребра куба. Найти площадь грани, площадь полной поверхности и объем этого куба.</p>
	</li>
</ol>
</div>

<div>
<h4>Задание 2</h4>
<ol>
	<li>
	<p>Вычислить</p>
		<?=TasklistHandler::tim(9, 2, 1)?>
	</li><li>
	<p>Определить, равен ли квадрат заданного трехзначного числа кубу суммы цифр этого числа.</p>
	</li><li>
	<p>Дан радиус круга R. Определить поместится ли правильный треугольник со стороной а в этом круге.</p>
	</li>
</ol>
</div>

<div>
<h4>Задание 3</h4>
<ol>
	<li>
	<p>Составить программу для проверки утверждения: «Результатами вычислений по формуле х<sup>2</sup>+х+41 при 0&lt;=х&lt;=40 являются простые числа.». Все результаты вывести на экран.</p>
	</li><li>
	<p>Даны: действительное число a, натуральное число n. Вычислить:</p>
		<?=TasklistHandler::tim(9, 3, 2)?>
	</li><li>
	<p>Найти сумму ряда с точностью &epsilon;=0,001 , общий член которого:</p>
		<?=TasklistHandler::tim(9, 3, 3)?>
	</li>
</ol>
</div>
<div>
<h4>Задание 4</h4>
<ol>
	<li>
	<p>Даны две строки. Если они начинаются с одинаковых символов, то напечатать «ДА», иначе –«НЕТ».</p>
	</li><li>
	<p>Дана символьная строка. Определить, сколько раз входит в нее группа букв : abc.</p>
	</li><li>
	<p>Двумерный массив МN содержит некоторые буквы русского алфавита, расположенные в произвольном порядке. Написать программу, проверяющую можно ли из этих букв составить данное слово S.</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 5</h4>
<ol>
	<li>
	<p>Найти количество и сумму нечетных элементов массива.</p>
	</li><li>
	<p>Найти количество элементов в каждой строке массива, больших (меньших) среднего арифметического элементов заданной строки.</p>
	</li><li>
	<p>Удалить строку и столбец, на пересечении которых стоит отрицательный элемент.</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 6</h4>
<ol>
	<li>
	<p>Составить программу, проверяющую, являются ли данные три числа взаимно простыми. </p>
	</li><li>
	<p>Написать программу вычисления суммы 1 + 1/2 + 1/3 + …+1/n для заданного числа n. Результат представить в виде несократимой дроби p/q (p, q — натуральные). </p>
	</li><li>
	<p>Составить программу перевода данного натурального числа в р-ичную систему счисления (2 &lt;= р &lt;= 9)</p>
	</li>
</ol>
</div>
<div>
<h4><?=$lang['Task']?> 7</h4>
<ol>
	<li>
	<p>Имеется список продуктов питания, хранящихся на оптовой базе. Для каждого из четырех магазинов указано,
	 какие продукты они получают с этой базы. Определить какие продукты
	  поступают с базы во все магазины; какие продукты поставляют хотя бы в два магазина;
	  какие продукты не поступают ни в один магазин. </p>
	</li><li>
	<p>Дан текст на русском языке. Напечатать в алфавитном порядке все глухие согласные буквы,
	которые не входят хотя бы в одно слово; все гласные, которые входят в каждое слово.</p>
	</li><li>
	<p>В равенстве ЛИК * ЛИК = БУБЛИК. замените буквы цифрами так, чтобы получилось тождество.</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 8 (<?=$lang['Objects']?>)</h4>
<ol>
	<li>
	<p>Распечатать фамилии детей данного детского сада, которые родились в указанном месяце; указать их возраст и группу.</p>
	</li><li>
	<p>Дано время, описанное в варианте 8. Описать процедуру, присваивающую параметру t1 время, на секунду большее времени t (учесть смену суток).</p>
	</li>
</ol>
</div>

<div>
<h4><?=$lang['Task']?> 9</h4>
<ol>
	<li>
	<p>Создать окно в рамке  на фоне, заполненном псевдографическим символом #178 зеленого цвета, с текстом из файла. По клавишам управления курсором выполнять скроллинг текста в окне на одну строку вверх или вниз.</p>
	</li>
</ol>
</div>
<div>
<h4><?=$lang['Task']?> 10</h4>
<ol>
	<li>
	<p>Сгенерировать граф, реализовать прохождение графа в ширину и обеспечить графическую визуализацию.</p>
	</li>
</ol>
</div>
