<header>
	<h3 class="">Что это.</h3>
</header>
<p>Здесь вы можете сделать свои самые первые шаги в программировании.</p>
<p>Эта страница предназначена для людей, делающих первые шаги в программировании. Вы можете читать этот текст и тут же набирать примеры кода в консоли ввода внизу и запускать их на выполнение. Таким образом, все что вам нужно для освоения основ программирования у вас под рукой.</p>
<p>Вы будете писать на языке JavaScript. Если вам кто-нибудь скажет, что яваскрипт - это несерьёзный язык, можете привести этому человеку в качестве аргумента "за JavaScript" гуглдиск (в том числе средства позволяющие работать с документами MS Office), <a href="http://threejs.org/examples/webgl_materials_cars.html" target="_blank">вот этот образец работы с 3D</a> (тут правда надо будет предварительно разрешить webGL в настройках браузера) и упомянуть о целой операционной системе, для которой ВСЕ пишется на JavaScript (по непроверенным данным, включая драйвера). Я имею ввиду FireFox OS. Грань между десктопным и веб - приложением в наши дни стирается.</p>
<p>Что бы вы не стремились создать после того как освоите JavaScript, веб-приложение, сайт, игру или десктоп приложение, вам точно не помешают в начале вашего пути типовые задачи, которые помогут освоить основные понятия и приемы программирования  не только JavaScript, но и довольно многих языков программирования.</p>
<p><a href="<?=WEB_ROOT?>/quick_start/wtf">Далее - Как пользоваться этим сайтом</a></p>
