<header>
	<h3 class="">Что это</h3>
</header>
<p>Здесь вы можете сделать свои самые первые шаги в программировании.</p>
<p>Главная идея этого небольшого сервиса в том, чтобы человек смог быстро приступить к решению задач по программированию, и 
понять "его" ли это занятие. В дальнейшем ему, конечно, не обойтись без освоения
сред разработки, компиляторов, отладчиков, систем контроля версий, инструментов для тестирования кода и так далее.
Но для быстрого старта этот сайт очень даже подойдет.
</p>

<?=Php7Handler::prevnext(false, 'wtf');?>
