<div class="promo">
	<header>
		<h1>Полезные ссылки</h1>
	</header>
	<style>a {color:#3279b2;}</style>
	<article>
		<header>
			<p class="promo_big">Полезные ссылки по программированию</p>
		</header>
		<p>
			Материалы, которые лично мне помогли стать программистом-"кодером" фрилансером с доходом от 30 до 80 тыр в месяц.
		</p>
		
		<p>
			Первые две ссылки прямого отношения к web не имеют, но для полноты картины я привел и их.
			(Этот сайт делался для того чтобы попытаться заменить их для людей, которые стремятся именно в web, но до завершения работы ещё далеко.)
		</p>
		
		
		<p>
			<a href="/files/2018/05/pav.zip" target="_blank">Т. А. Павловская Turbo Pascal</a>
			Первая книга по программированию которую прочел.
			Прямого отношения к web не имеет, 
			но тем не менее все языки, 
			которые используются при программировании для web сильно похожи на С/С++ 
			и иногда немного на Паскаль. Пользуясь этой книгой (иногда ещё учебниками по мат. анализу и дискретной математике) я решил
			все задачи из 11-ого варианта представленные на этом сайте <a target="_blank" href="/tasklist">тут</a>
			Интернета у меня тогда не было.
		</p>
		
		<p>
			<a href="/files/2018/05/laptev.zip" target="_blank">В. В. Лаптев C/C++</a>
			Вторая книга по программированию которую уже толком не читал, дошел примерно до 40-ой страницы, дальше использовал как справочник при решении 4-ого варианта.
			Прямого отношения к web не имеет, но тем не менее все языки, которые используются при программировании для web (а также для смартфонов Android и iPhone) сильно похожи на С/С++.
			Пользуясь этой книгой (иногда ещё учебниками по мат. анализу и дискретной математике) я решил
			все задачи из 4-ого варианта представленные на этом сайте <a target="_blank" href="/tasklist">тут</a>
			Интернета у меня тогда не было.
		</p>
		
		<p>
			<a href="/files/2018/05/html_t.zip" target="_blank">Учебник по html "Для чайников"</a>
			Дело было так: Я писал курсовой, моя программа должна была генерить отчеты с ходом решений разных уравнений (в частности методом Джордана-Гаусса, Крамера и прочую скукотень).
			Сроки поджимали, я сравнил форматы файлов doc, rtf и html, понял, что проще чем html просто не бывает и остановился на нём.
			<b>В сущности с тех пор кроме справочников и статей в Интернете не читал ничего</b> (немного читал Хогана, но это уже второй этап, о нём ниже). Мне хватает фундамента из этих по сути любительских заметок.
			<b>Важно: 90% информации актуально и сегодня, но всё же лучше эти уроки изучать и выполнять в каком-нибудь не очень новом браузере.</b>
			<a href="https://ftp.mozilla.org/pub/firefox/releases/4.0/win32/ru/" target="_blank">Версия Mozilla Firefox 4 вполне подойдёт</a>
			Если будете использовать новый браузер обращайте внимание на мои комментарии, они выглядят вот так:
			<img src="/files/2018/05/my_note.png"><br>
			Но я мог что-то пропустить, поэтому лучше используйте старый браузер.
		</p>
		
		
		<p>
			<a href="/files/2018/05/php.zip" target="_blank">PHP по 10 минут на урок</a>
			Мне понадобилось отлаживать взаимодействие своих программ с web сервером.
			Потопал в книжный, купил эту книгу. Больше по php никаких книг не читал, только статьи в Интернете.
			Сейчас уже почти актуально php7, но для начала подойдёт, практически все что описано в 
			книге будет корректно интерпретироваться php7.
			В книге помимо всего прочего описана установка веб сервера и php интерпретатора на свой компьютер с ОС windows.
			Можно не мучаться, скачать и поставить <a href="//denwer.ru" target="_blank">DENWER</a>. А можно помучаться, пригодиться потом.
			
		</p>
		
		<p>
			Мне сейчас лень откапывать лекции по sql из вуза, вместо этого я даю ссылку на <a href="/files/2018/05/sql.zip">учебник, который ничем не хуже</a>.
			Где эти самые sql запросы выполнять? Если вы не установили DENWER в предыдущем пункте, снесите ваш апач и установите DENWER.
			Там будет ссылка на phpmyadmin в нем вы и сможете выполнять (для начала) SQL запросы.
			У нас на работе большинство до сих пор в нём выполняют, хотя конечно можно и через консоль. Да что там я и сам выполняю sql запросы через консоль только по настроению или когда очень быстро надо.
		</p>
		
		<p>Примерно тогда же я узнал о книге <a href="/files/2018/05/4.zip">Банды Четырёх</a>
			Внимание, я её перечитываю до сих пор!
			Это книга которую можно понять только после учебника по програмимированию, хотя бы предыдущего учебника Криса Ньюмана.
			Это более высокий уровень: как уже зная язык программирования писать на нем правильный код.
		</p>
		
		<p><b style="color:red;">Всё</b>, этих знаний мне хватило чтобы впервые устроиться php - программистом в офис. Первые три месяца ходил как контуженный, так как на практике в реально работающем проекте всё оказалось
		замудрённее чем то что я писал сам имея знания из описаных выше источников.
		Но тем не менее перечисленных книг вполне достаточно, 
		чтобы написать 
		например интернет магазин в котором при желании можно будет сделать покупку. 
		Далее переходите к курсам из Школы Программирования.
		</p>
		
		<p>
			Почему я ничего не написал о JavaScript. Потому что я его никогда специально не изучал, что не мешает мне на нем писать (C/C++ а также у меня был практический опыт ActionScript который поддерживал единый стандарт с JS). Сейчас есть отличный <a href="http://learn.javascript.ru/" target="_blank">онлайн-учебник </a>, я читаю в нем то что касается ES2015+.
			После него (или почти вместе с ним, можно во второй половине) необходимым будет также <a href="/files/2018/05/jq.zip">jQuery</a>
		</p>
		
		<p>
			Что дальше.
		</p>
		
		<p>Обучение программиста не заканчивается никогда.</p>
		
		<p>Раз уж упомянул, приложу книгу <a href="/files/2018/05/x.zip">Хогана. Её можно читать после видеокурсов.</a></p>
		
		<p>Уже написав горы кода на JavaScript прочел книгу Стояна Стефанова  - JavaScript. Шаблоны - 2011. Это не для изучения JavaScript! Это более высокий уровень: как уже зная язык программирования писать на нем правильный код.
			<a href="/files/2018/05/ss.zip">Её можно читать после видеокурсов.</a>
		</p>
		
		<p>Про фреймвёрки. Когда вы будете искать работу вы то и дело будете сталкиваться с названиями фреймверков. Например Symfony, Laravel, Yii для бекенда (php)  и Angular, VueJS, ReactJS для фронтенда (js). Bootstrap для css.</p>
		<p>По моему скромному мнению, научитесь сначала работать без них. Фреймверки приходят и уходят, а языки программирования остаются.</p>
		<p>Какой фреймверк изучать?</p>
		<p>Когда будете знать html, css, js, php, открываете список вакансий <a href="https://moikrug.ru/" target="_blank">Здесь</a> смотрите наиболее часто встречающийся, тратите пару недель на изучение его азов, беретесь за одну из вакансий.</p>
		<p>Вас не примут, но вы получите ТЗ, которое завалите.</p>
		<p>После двух-трех вакансий по этому же фреймвёрку вас скорее всего возьмут - при том условии что вы выполните ТЗ.</p>
		
		<p>Напоследок, что я только буду читать.</p>
		
		<p>
			<a href="/files/2018/05/pjs.zip" target="_blank">Паттерны_для_масштабируемых_JavaScript</a>
		</p>
		
		
		<p>
			<a href="/files/2018/05/refact.zip" target="_blank">Refactoring_to_Patterns_proglib.pdf</a>
			Нет, я не знаю английский. В 2014 благодаря постоянной практике чтения англоязычных статей по программированию почти привык.
			С тех пор подзапустил, но вспомню, куда же деваться.
		</p>
	</article>
</div>
